[
  {
    "path": "posts/2022-12-13-cost-management-tool/",
    "title": "Cost Management Tool",
    "description": "A tool to allow users to estimate the costs of running generators based on hypothetical scenarios",
    "author": [
      {
        "name": "Gerard Causse",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-12-15",
    "categories": [],
    "contents": "\r\nThis tool is near and dear to my heart, since it might be the project that got me my job. It was also probably the biggest single project I worked on in my time at EPRI. The idea behind this tool was simple, EPRI had contracted a company to make an Excel based tool for them that they could share with those who EPRI advises. This tool would allow a group to input the number of power plants they wanted to compare and the associated information on how often they have to start or stop their generators. These starts and stops are costly for a number of reasons, some as simple as when the generators aren’t running, they aren’t making money off of it, as well as more complicated reasons such as starting/stopping a generator is very stressful to the materials within that generator.\r\nOne of the important factors of this tool was the ability for users to inputs both how often they had started/stopped their generators, as well as plan out how often they would do it in the future. The tool would then plot graphs for the user based on these inputs and compare “historical” data (certain data from the past) to “scenario” data (hypothetical data for the future).\r\nHowever, one of the big problems with this approach was that updates would need to be made to the way the tool worked, and when you can only distribute an updated file occasionally it could be hard for everyone to use the most recent version of the tool. So EPRI decided to have me take a crack at recreating the tool as a web-based tool in Python using Streamlit.\r\nHowever, because the tool wasn’t developed by EPRI, no one knew how it worked exactly in the backend, so my job was to dig into the Excel files and reverse engineering everything to get it working. While it might not be as glamourous as something like machine learning, the simple fact of the matter is that for most people, what data “looks like” is an Excel file, and so it’s important to be up to date on understanding how it works, as it comes in handy quite often when working with people less technical than ourselves.\r\nBut beyond that, the web-based tool was made, and it works well! I even added in some exclusive features, like allowing the user to compare various plots against each other at the same time, and they can even download a pdf report from the web based on their inputs.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-12-15T16:31:59-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-12-13-materials-and-repair-toolbox/",
    "title": "Materials and Repair Toolbox",
    "description": "A description of the various tool made for the Materials and Repair team.",
    "author": [
      {
        "name": "Gerard Causse",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-12-15",
    "categories": [],
    "contents": "\r\nThis project is really more like a set of projects combined into one, each tool doing a different job, but all of them useful to engineers. This post will go into detail about each tool in this toolbox.\r\nGrade 91 Tempering Tool\r\nGrade 91 steel is often tempered before it is used in power plants to increase its quality of use. Tempering involved heating a metal to the “lower critical temperature” which causes the steel to become more ductile and less brittle in exchange of making it less hard. The purpose of this tool was to allow the user to input various factors of the steels tempering process to get a confidence interval of how much they could expect the steel’s hardness to reduce due to tempering.\r\nOxide Scale Calculator\r\nOne of the many factors that affects the materials used in power plants is called Oxide Scale. Pipes within these power plants funnel steam through them, and the oxygen in these pipes will react with the steel and produce an oxide scale layer. This oxide scale is to steel what rust is to iron. Luckily for us, this oxide scale is predictable, and as long as we know the temperature of the metal and how long it’s been in service, we can predict how thick the oxide scale layer will be. Even better, knowing any 2 of the 3 variables, oxide scale, metal temperature, and service duration, we can predict the third. This tool was designed to allow users to select what they want to calculate for and provide the other variables as inputs to get their answer.\r\nMetallurgical Risk Comparison\r\nWhile steel is the main metal used in power plants for construction, not all steels are made equal, and most have trace amounts of various elements within their makeup. These elements affect the strength of the steel and can be the difference between risky designs and safe designs. EPRI did man experiment sand collected data on what elemental makeups were safe and how much was tolerable. This tool would allow the user to upload a csv or Excel workbook of the materials used in their designs and it would plot these materials along various graphs and show which materials presented a risk to the power plants design.\r\nCreep Life Calculator\r\nWhen materials are under pressure, they will deform. Imagine a bookcase with no books on it, the shelves would be very straight. But add several encyclopedias to the book shelf and you would see the shelf undergoes some deformation due to the initial strain of the added pressure. But once the initial deformation happened, as long as the shelf was strong enough to support the weight of the books, it would hold. However, when under constant stress, the shelf would continue to deform, ever so slightly, over long periods of time. This continued deformation over time is called creep, and as the material continues to deform it will get slightly weaker. Eventually, this material will reach the final stage, rupture, where it will break under the pressure. This tool is the result of EPRI’s research on various materials of different conditions (new, used, etc.) and applying constant pressures to them over the span of years. This tool plots the results of these experiments, and also allows the user to input the type of metal they are working with, its condition, and the pressures it is under to predict how long they can expect the material to last.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-12-15T16:32:51-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-12-13-simple-stress-calculators/",
    "title": "Simple Stress Calculators",
    "description": "A tool to allow engineers to perform quick calculations for how much stress a pipe can endure.",
    "author": [
      {
        "name": "Gerard causse",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-12-15",
    "categories": [],
    "contents": "\r\nThis toolset was designed for the Power Plant Piping group at EPRI, and the concept here is fairly simple. The tools developed here are used to predict how much stress pipes of various shapes will undergo based on user inputs. For example, a straight round pipe will undergo less structural stress than a pipe with a gentle curve when all else is equal.\r\nThe way the tool works if simple, the user clicks on the type of pipe they would like to perform a calculation for, and then the tool will prompt them with the appropriate inputs to fill out. The tool then performs a calculation based on the inputs, and will tell the user how much stress the pipe will undergo and to make sure the materials used can withstand it. If applicable, it will also tell the user where the weakest point is in the pipe (inside a bend, or at a joint location).\r\nAs for the calculations themselves, EPRI has spent a long time testing various pipes under various conditions and collecting data on when they break and how much pressure they can withstand. These calculations are the result of careful regressions performed on said data, and we plug in the variables into these regression equations.\r\nOf course, as the name implies, this is a relatively simple tool and calculation, in the real world many factors go into these types of estimates, material quality and age, how long it’s been under stress, if this stress changes consistently, ect. But this tool allows engineers a quick and easy way to estimate what kind of materials they need, or if they need to rethink some plans.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-12-15T16:33:04-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-12-13-introduction-and-background/",
    "title": "Introduction and Background",
    "description": "Explaining who I am and what the work I do is.",
    "author": [
      {
        "name": "Gerard Causse",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-12-13",
    "categories": [],
    "contents": "\r\nHello and welcome to my blog. My name is Gerard Causse, and this blog covers the projects I have been working on for EPRI, the Electrical Power Research Institute, the company I work for. these projects combined are my senior project, and I have been working on them full time since September 2022.\r\nTo give you some background, I am a senior at Brigham Young University – Idaho majoring in Data Science. Back in April of 2022 I was hired as an intern at EPRI as a data science/programming student employee. The Electrical Power Research Institute, (EPRI), is a non-profit company that does research for and on the power plants around the country. Companies interested in the research done by EPRI can help fund their research, and in exchange, receive the results of this study.\r\nEPRI does research into many components of power generation, including nuclear power, the low carbon research initiative, technological innovation, and many more. I work for the Materials and Repair section of the Generation group, and so most of the work I do involves analyzing the data we collect from the materials used in power plants and provide insights on how long they can last and what repair options are available.\r\nAs mentioned earlier, I work as a programmer here, and a lot of what I do here is develop web-based tools that would allow engineers and workers at power plants to perform calculations based on their needs for specific problems. These tools are written in Python and are made available online using a module called Streamlit.\r\nWhen working with websites and web tools, generally a developer would need to know how to write HTML, CSS, and JavaScript code. But a lot of data science work is done with Python which wasn’t designed for working on websites. What Streamlit does is allow a Python developer to write a script that will then be converted into a web page using HTML, CSS, and JavaScript. Normally websites need to be given structure by HTML, made pretty by CSS, and made interactable with JavaScript. These will then communicate with a backend of some sort, often Java, to receive instructions on how to handle user input as fetch additional information when needed. Streamlit basically allows me to do all of this with just Python. These Python scripts will be run every time the user interacts with the page, (clicking a button, for example). In a way, you can think of Streamlit as a full stack development all-in-one tool.\r\nAnd so, my work here was to write Python scripts that could be rerun quickly and efficiently to allow the user to interact with the webpages while also displaying graphs or calculations or whatever else the webpage needs to help the user out. The rest of the posts on this blog will go into detail for the tools I have developed or helped to develop in my time here.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-12-15T16:32:22-05:00",
    "input_file": {}
  }
]
